---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateLine
source: html/2481ed55-5e41-5a1a-1be5-2143c91ffffd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateLine Property

Line is slightly off axis and may cause inaccuracies.

## Syntax (C#)
```csharp
public static FailureDefinitionId InaccurateLine { get; }
```